# RbsEnergyAnalysisViewRbeMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisViewRbeMode Property
ParameterTypeId Class See Also
---
"Show Room Bounding Elements Dimmed and Underlay"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisViewRbeMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisViewRbeMode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewRbeMode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace